<div id="tutorial_modal" class="modal fade">
  <div class="modal-dialog modal-lg">
    <div class="modal-content">
      <div class="modal-header">
        <button type="button" class="close" data-dismiss="modal" aria-label="Close"><span aria-hidden="true">&times;</span></button>
        <h4 class="modal-title">Tutorial</h4>
      </div>
      <div class="modal-body">
          <div class="row">
            <div class="col-md-3">
                <div id="tutorial-menu"  class="list-group">
                    <a href="#tutorial-0" class="list-group-item active">Εισαγωγή στην ιστοσελίδα</a>
                    <a href="#tutorial-1" class="list-group-item">Sign-in</a>
                    <a href="#tutorial-2" class="list-group-item">Sign-up</a>
                    <a href="#tutorial-3" class="list-group-item">Νέα Δημοσίευση</a>
                    <a href="#tutorial-4" class="list-group-item">Λειτουργίες του Συστήματος</a>
                    <a href="#tutorial-5" class="list-group-item">Forum</a>
                    <a href="#tutorial-6" class="list-group-item">Timeline</a>
                    <a href="#tutorial-7" class="list-group-item">Roads</a>
                    <a href="#tutorial-8" class="list-group-item">Notifications</a>
                    <a href="#tutorial-9" class="list-group-item">Search</a>
                    <a href="#tutorial-10" class="list-group-item">Αλλαγή Στοιχείων</a>
                    <a href="#tutorial-11" class="list-group-item">Chat</a>
                </div>
              </div>
              <div id="tutorial-content" class="col-md-9">
                <div><h1 id="tutorial-0">Εισαγωγή στην ιστοσελίδα</h1><p>Μπαίνοντας λοιπόν στη ιστοσελίδα μας, η πρώτη εικόνα που παρουσιάζεται στο χρήστη, είναι ο χάρτης της Κύπρου, στον οποίο επισημαίνονται τα σημεία στα οποία υπάρχουν κοινοποιήσεις.  </p><img src="_/img/tutorial/0.1.png"/><p>Ο χρήστης όμως το μόνο που μπορεί να επιχειρήσει, είναι να δει τις υπάρχουσες δημοσιεύσεις, πατώντας πάνω σε συγκεκριμένο marker.</p><img src="_/img/tutorial/0.2.png"/><p>Αυτό γιατί δεν έχει κάνει log in.</p><img src="_/img/tutorial/0.3.png"/></div>
                <div><h1 id="tutorial-1">Sign-in</h1><p>Αν λοιπόν έχει ήδη δημιουργημένο account τότε, το μόνο που έχει να κάνει είναι να πατήσει στο εικονίδιο για εισαγωγή στο σύστημα το οποίο βρίσκεται πάνω δεξιά στην οθόνη του.  </p><img src="_/img/tutorial/1.1.png"/><p>Αυτομάτως, μετά την ενέργεια αυτή, θα εμφανιστεί στην οθόνη του το παράθυρο εισαγωγής του στο σύστημα.  Εισάγοντας ορθός τα e-mail και password, τότε μπορούν να περιηγηθούν στην ιστοσελίδα μας, έχοντας στη διάθεση τους όλες τις υπηρεσίες που αυτό προσφέρει.</p><img src="_/img/tutorial/1.2.png"/></div>
                <div><h1 id="tutorial-2">Sign-up</h1><p>Στην περίπτωση όμως που δεν είναι ήδη μέλος της ιστοσελίδας, τότε οφείλει να εγγραφεί σε αυτή κάνοντας sign-up.  Sign-up γίνεται πατώντας στην αναγραφόμενη, ομώνυμη ετικέτα, η οποία βρίσκεται πάνω και δεξιά στην οθόνη, δίπλα ακριβός από το sign-in.</p><img src="_/img/tutorial/2.1.png"/><p>Για  την εισαγωγή νέου χρήστη, το σύστημα αιτείται μερικά στοιχεία του τελευταίου, ούτως ώστε να παρουσιάζεται ως μοναδικός και ξεχωριστός για το σύστημα.  Έτσι, όπως φαίνεται και στην κάτωθι εικόνα ζητούνται με τη σειρά όνομα, επίθετο, ημερομηνία γέννησης, φύλο, τόπος διαμονής (πριν και μετά το 74), e-mail και κωδικός.</p><img src="_/img/tutorial/2.2.png"/><img src="_/img/tutorial/2.3.png"/><p>Συμπληρώνοντας, σωστά, τα πιο πάνω και πατώντας το κουμπί Sign-up, θεωρείται νέος χρήστης. 
</p><img src="_/img/tutorial/2.4.png"/><p>Έχει της ευχέρεια λοιπόν να κάνει log-in εισάγοντας το δικό του e-mail και password, όπως εξηγήσαμε πάρα πάνω.</p><img src="_/img/tutorial/2.5.png"/></div>
                <div><h1 id="tutorial-3">Νέα Δημοσίευση</h1><p>Με την εισαγωγή του στο σύστημα ο χρήστης, μπορεί να προβεί σε όλες τις ενέργειες που αυτό του παρέχει και θα παρουσιαστούν πιο κάτω αναλυτικότερα.  

Η βασική δυνατότητα που δίνεται στον κάθε χρήστη, είναι η εισαγωγή νέας δημοσίευσης στο χάρτη.  Για κάθε μια από τις αναρτήσεις, απαιτείται η ακριβής τοποθέτηση της σε αυτόν.  Για την υλοποίηση της συγκεκριμένης ενέργειας, ο χρήστης καλείται να πατήσει σε οποιαδήποτε σημείο του χάρτη, το σημείο δηλαδή το οποίο θα αναφέρεται στην δημοσίευση του.
</p><img src="_/img/tutorial/3.1.png"/><p>Οι δημοσιεύσεις χωρίζονται στις τέσσερις κατηγορίες: Ανάμνηση(Memoir), Άρθρο(Article), Ιδιοκτησία(Property) και Φωτογραφία(Photo).  

Αν και οι κατηγορίες είναι αυτο-επεξηγηματικές, θα αναφερθούμε λίγο σε αυτές για να γίνουν τελείως ξεκάθαρες.  Στην κατηγορία αναμνήσεις, ο χρήστης καλείται να τοποθετεί οτιδήποτε έγινε στο παρελθόν και ήταν παρόν.  Αυτό περικλείει από το πιο απλό συμβάν πχ χώρος συνάντησης της παρέας του, μέχρι και κάτι σημαντικό, όπως για παράδειγμα που είδε για τελευταία φορά κάποιο συγγενή του αγνοούμενο κτλ.  Στην δεύτερη κατηγορία, αυτή του άρθρου, ο χρήστης εισάγει ένα πιο εκτεταμένο κείμενο στο οποίο θα αναφέρεται σε συγκεκριμένο θέμα το οποίο και αναλύει. Στη συνέχεια, για την κατηγορία της ιδιοκτησίας ο κάθε ένας δηλώνει που ήταν το σπίτι του, τα χωράφια του κτλ.  Στην τελευταία κατηγορία, της φωτογραφίας, μπορεί να εισάγει, προφανώς, κάποια φωτογραφία και να την περιγράψει συνοπτικός.

Κάθε δημοσίευση πλαισιώνεται από τίτλο και ημερομηνία (σε αυτή που αναφέρεται).</p><img src="_/img/tutorial/3.2.png"/><p> Ακόμη ο χρήστης έχει τη δυνατότητα να εισάγει σε αυτή και tags.  Τα tags(ετικέτες) μπορεί να είναι οποιαδήποτε λέξη, η οποία περιγράφει την εν λόγο δημοσίευση.  Οι λέξεις αυτές διευκολύνουν την αναζήτηση και εύρεση της από κάποιο άλλο χρήστη, δυνατότητα η οποία θα εξηγήσουμε αργότερα. </p><img src="_/img/tutorial/3.3.png"/><p>Η επιλογή μιας εκ των τεσσάρων κατηγοριών είναι απλή.  Αυτό γιατί η επιλογή εκάστης, εξαρτάται από την αντίστοιχη επιλογή μιας εκ των τεσσάρων, οι οποίες είναι αναγραφόμενες στη μέση του modal, και μπορεί ο χρήστης να διαλέξει.  Η προεπιλεγμένη κατηγορία είναι αυτή της ανάμνησης και για να γίνει αλλαγή θα χρειαστεί ο χρήστης να διαλέξει την κατηγορία της αρεσκείας του.  </p><img src="_/img/tutorial/3.4.png"/><img src="_/img/tutorial/3.5.png"/><p>Για τις δύο κατηγορίες, των αναμνήσεων και των άρθρων, ο χρήστης μπορεί να γράψει μόνο κείμενο και να το δημοσιεύσει.  </p><img src="_/img/tutorial/3.6.png"/><img src="_/img/tutorial/3.7.png"/><p>Για την κατηγορία της ιδιοκτησίας υπάρχει η επιλογή για τύπο του ακινήτου και σύντομη περιγραφή.  </p><img src="_/img/tutorial/3.8.png"/><p>Περιγραφή επίσης υπάρχει και για την ανάρτηση φωτογραφίας.</p><img src="_/img/tutorial/3.9.png"/><p>Μόλις λοιπόν συμπληρωθούν τα απαιτούμενα πεδία και πατηθεί το κουμπί Post τότε το συγκεκριμένο δημοσίευμα αναρτάται στον χάρτη και στη θέση που ο χρήστης το έχει τοποθετήσει.  </p><img src="_/img/tutorial/3.10.png"/><p>Η κάθε κατηγορία δημοσίευσης παρουσιάζεται με διαφορετικό χρώμα έτσι ώστε να μπορούν να ξεχωρίζουν.  Με κόκκινο χρώμα είναι οι Αναμνήσεις, με πράσινο τα Άρθρα, με μπλε η Ιδιοκτησία και με κίτρινο οι Φωτογραφίες.
</p><img src="_/img/tutorial/3.11.png"/><p>Την κάθε ανάρτηση οι χρήστες μπορούν να τη δουν πατώντας πάνω στο marker αυτής, να την σχολιάσουν(comment) αλλά και να τη αναφέρουν(report).  Πατώντας επομένως πάνω σε μια δημοσίευση παρουσιάζονται τα σχόλια που την αφορούν, στο κάτω της μέρος.  Για τη δημιουργία νέου σχολιασμού ο χρήστης γράφει στο πεδίο που βρίσκεται στο κενό πεδίο κάτω από αυτή, και πατά comment.  Τότε το νέο σχόλιο τοποθετείται μαζί με τα προηγούμενα και στη πρώτη θέση.  </p><img src="_/img/tutorial/3.12.png"/><img src="_/img/tutorial/3.13.png"/><p>Τέλος αν κάποιος θεωρήσει μια ανάρτηση μη πρέπουσα, μπορεί να το κάνει πατώντας το κόκκινο κουμπί, το οποίο βρίσκεται κάτω δεξιά στο συγκεκριμένο παράθυρο.  Γράφει τον λόγο της αναφοράς και στέλνεται ανάλογο e-mail στους administrators του συστήματος.</p><img src="_/img/tutorial/3.14.png"/><img src="_/img/tutorial/3.15.png"/></div>
                <div><h1 id="tutorial-4">Λειτουργίες του Συστήματος</h1><p>Οι επιπλέον υπηρεσίες που παρέχονται από την ιστοσελίδα μας, είναι προσβάσιμες στους χρήστες μέσω του μενού που βρίσκεται στο navbar,  στην οριζόντια γραμμή ακριβώς πάνω από τον χάρτη. Προσφέρονται λοιπόν, κάποιες επιπλέον δυνατότητες και διευκολύνσεις στο χρήστη, για περαιτέρω τρόπους δημοσίευσης, αλλά και για απλούστευση της ‘‘αλίευσης’’ αυτών.  Πιο κάτω θα παραθέσουμε μια-μια αυτές τις εν λόγω υπηρεσίες και τον τρόπο που η κάθε μια λειτουργεί.

Πρώτα απ΄ όλα να αναφέρουμε ότι η οριζόντια αυτή γραμμή, είναι ορατή από όλες τις οθόνες της ιστοσελίδας.  Αυτό παρέχει την δυνατότητα στους χρήστες, οποτεδήποτε θέλουν να επιστρέψουν στην αρχική σελίδα να το πράξουν πατώντας στη λέξη Demographics, τη πρώτη λέξη που εμφανίζεται στο navbar.</p><img src="_/img/tutorial/4.1.png"/></div>
                <div><h1 id="tutorial-5">Forum</h1><p>Πιο δίπλα αναγράφεται η λέξη Forum.  Forum για τον κάθε χρήστη ορίζεται ως η σελίδα όπου ο ίδιος συνυπάρχει μαζί με του συγχωριανούς του, και ανταλλάσσουν μηνύματα για διάφορα συμβάντα, ερωτήματα, ανησυχίες κτλ που αφορούν το χωριό του.  Δηλαδή πατώντας ο χρήστης το συγκεκριμένο κουμπί, στην οθόνη παρουσιάζονται τα μηνύματα που έχουν γραφεί από συγχωριανούς του, και απευθύνονται και αφορούν μόνο το δικό τους χωριό.  

Η σελίδα του forum μπορεί να χωριστεί σε τρία κομμάτια, ξεκινώντας από πάνω προς τα κάτω.  Πρώτα το καλωσόρισμα, μετά η μπάρα για τις δημιουργία νέας δημοσίευσης και έπειτα τα προϋπάρχοντα μηνύματα.  Για να γίνει, τώρα, μια νέα ανάρτηση αρκεί ο χρήστης να πατήσει στο κουμπί συν(+) που βρίσκεται στη μπάρα, και θα εμφανιστεί ένα παράθυρο για εισαγωγή τίτλου και κειμένου.  Ολοκληρώνοντας τα συγκεκριμένα πεδία και πατώντας Post γίνεται η νέα, δική του δημοσίευση.  Τέλος για κάθε μία από τις δημοσιεύσεις επιτρέπεται ο σχολιασμός και η αναφορά, με τρόπο πανομοιότυπο, των αντίστοιχων λειτουργιών, που στις δημοσιεύσεις χάρτη περιγράψαμε πρωτύτερα. </p></div>
                <div><h1 id="tutorial-6">Timeline</h1><p>Δεύτερο από αριστερά βρίσκεται το timeline.  Το πλαίσιο που ανοίγει με το timeline, βοηθά τους χρήστες να δουν χρονολογικά, όλες τις αναρτήσεις που έγιναν στο χάρτη.  Στο πάνω μέρος του πλαισίου αυτού βρίσκεται η αναφορά και το περιεχόμενο της δημοσίευσης.  Για να επιλέξει μια τέτοια ο χρήστης πρέπει να διαλέξει τη συγκεκριμένη που επιθυμεί από το κάτω μέρος του πλαισίου, στο οποίο από τα αριστερά προς τα δεξιά παρουσιάζονται με χρονική τοποθέτηση.  Η ταξινόμηση τους γίνετε σύμφωνα με το χρόνο, όχι που αναρτήθηκαν αλλά αυτόν, που αναφέρονται και περιγράφουν στη δημοσίευση και ο δημιουργός εισήγαγε κατά της διαδικασία ανάρτησης.</p><img src="_/img/tutorial/4.2.png"/></div>
                <div><h1 id="tutorial-7">Roads</h1><p>Ακόμη μια λειτουργία, είναι και αυτή των Roads.  Όπως είναι αντιληπτό, η λειτουργία αυτή έχει να κάνει με τους δρόμους της Κύπρου.  Μπορούν επομένως να σημανθούν οι δρόμοι και να εντοπιστούν από τους μετέπειτα χρήστες του συστήματος. Για να γίνει αυτό πρέπει να χαραχθεί η πορεία του δρόμου, δραστηριότητα που γίνεται πατώντας σε διαδοχικά σημεία στο χάρτη για τη διαμόρφωση της πορείας αυτής.  Η διαδρομή επισημαίνεται με markers που σε όποιον από αυτούς πατήσει ο χρήστης, μπορεί να δει την απεικόνιση του σε νέο παράθυρο, να προσθέσει το όνομα του και να τον δημοσιεύσει. Τέλος ο χρήστης δύναται και να σχολιάσει τον κάθε δρόμο, λειτουργία που είναι ήδη γνωστή.</p><img src="_/img/tutorial/5.1.png"/><img src="_/img/tutorial/5.2.png"/></div>
                <div><h1 id="tutorial-8">Notifications</h1><p>Πιο δίπλα υπάρχουν οι ειδοποιήσεις(notifications).  Μια νέα ειδοποίηση παρουσιάζεται όταν κάποιος σχολιάσει μια δική μας ανάρτηση, και πατώντας πάνω σε αυτό παραπέμπεται στη δημοσίευση που έχει σχολιαστεί.
</p></div>
                <div><h1 id="tutorial-9">Search</h1><p>Τελευταία λειτουργία που βρίσκεται στο navbar είναι αυτή της αναζήτησης.   Αναζητούνται λοιπόν οι δημοσιεύσεις χάρτη, μέσω των tags στα οποία έγινε αναφορά στην αρχή.  Έτσι μετά την αναζήτηση, παρουσιάζονται στο χρήστη όλες οι δημοσιεύσεις που ικανοποιούν την αίτηση του, δηλαδή όλες όσες η λέξη που έχει γραφεί από τον ίδιο στο πεδίο του search, ταυτίζεται με κάποιο από τα tags της δημοσίευσης.  </p><img src="_/img/tutorial/6.1.png"/><p>Επίσης, στο κάτω αριστερά μέρος της ιστοσελίδας, εμφανίζεται ένα νέο παράθυρο το οποίο χωρίζει όλες τις κατηγορίες και τα χρώματα τους.  </p><img src="_/img/tutorial/6.2.png"/><p>Αν πατηθεί κάποια κατηγορία τότε οι δημοσίευσης αυτής φεύγουν από τον χάρτη, ενώ στην επανάληψη της προαναφερθείσας ενέργειας εμφανίζονται ξανά.</p><img src="_/img/tutorial/6.3.png"/><p>Τέλος στο κάτω μέρος του καινούργιου παραθύρου βρίσκεται η επιλογή Date.  Αυτό απεικονίζεται σε slider, όπου με τη μετακίνηση των άκρων του, υπάρχει παράλληλη αλλαγή στο χρονολογικό διάστημα που τα αποτελέσματα(δημοσιεύσεις) του συστήματος θα εντοπίζονται.</p></div>
                <div><h1 id="tutorial-10">Αλλαγή Στοιχείων</h1><p>Ο χρήστης έχει την επιλογή αλλαγής κωδικού πρόσβασης καθώς και αλλαγή των στοιχείων του στο σύστημα.  Οι επιλογές αυτές βρίσκονται στο πάνω δεξί μέρος της κύριας ιστοσελίδας και παρουσιάζονται σε λίστα όταν πατηθεί το μπλε εικονίδιο.  Τέλος από το ίδιο σημείο μπορεί ο χρήστης να αποσυνδεθεί από το σύστημα και έτσι να διασφαλίσει ότι κανένας δεν θα δημοσιεύσει το οτιδήποτε χρησιμοποιώντας το δικό του όνομα.</p><img src="_/img/tutorial/7.1.png"/></div>
                <div><h1 id="tutorial-11">Chat</h1><p>Για το τέλος αφήσαμε την λειτουργία της απευθείας συζήτησης(chat).  Η πρόσβαση στη λειτουργία γίνεται από το footer, δηλαδή την οριζόντια γραμμή στο κάτω μέρος της ιστοσελίδας όπου βρίσκεται και το εικονίδιο της λειτουργίας στη δεξιά πλευρά.  Με το πάτημα αυτού, μπορεί ο χρήστης να δει τη συζήτηση που υπάρχει από την στιγμή που μπαίνει στο σύστημα μέχρι εκείνη που θα το εγκαταλείψει, και να μπει και αυτός στη συζήτηση αποστέλλοντας κάποιο μήνυμα.         </p></div>
              </div>
          </div>
      </div>
      <div class="modal-footer">
        <button type="button" class="btn btn-default" data-dismiss="modal">Close</button>
      </div>
    </div>
  </div>
</div>

<script>
    var slim_scrolled;
    $(function(){
        slim_scrolled=$('#tutorial_modal .modal-body .col-md-9').slimScroll({
            height: '540px'
        });     
        
        slim_scrolled.bind('scroll', function(e, pos){
            
            var scroll=$('#tutorial-content').scrollTop();
            
            $('#tutorial-content div').each(function(index){
                //alert(index+": "+$(this).offset().top);
                if(scroll>$(this).offset().top && scroll<=($(this).offset().top+$(this).height())){
                    $('#tutorial-menu a.active').removeClass('active');
                    if(index==0){
                        $("#tutorial-menu a[href='#tutorial-0']").addClass('active');
                    }else if(index==1){
                        $("#tutorial-menu a[href='#tutorial-1']").addClass('active');
                    }else if(index==2){
                        $("#tutorial-menu a[href='#tutorial-2']").addClass('active');
                    }else if(index==3){
                        $("#tutorial-menu a[href='#tutorial-3']").addClass('active');
                    }else if(index==4){
                        $("#tutorial-menu a[href='#tutorial-4']").addClass('active');
                    }else if(index==5){
                        $("#tutorial-menu a[href='#tutorial-5']").addClass('active');
                    }else if(index==6){
                        $("#tutorial-menu a[href='#tutorial-6']").addClass('active');
                    }else if(index==7){
                        $("#tutorial-menu a[href='#tutorial-7']").addClass('active');
                    }else if(index==8){
                        $("#tutorial-menu a[href='#tutorial-8']").addClass('active');
                    }else if(index==9){
                        $("#tutorial-menu a[href='#tutorial-9']").addClass('active');
                    }else if(index==10){
                        $("#tutorial-menu a[href='#tutorial-10']").addClass('active');
                    }else if(index==11){
                        $("#tutorial-menu a[href='#tutorial-11']").addClass('active');
                    }
                }
            });
        });
    });
        
   
    
    $('#tutorial-menu a').on('click',function(e){
        $('#tutorial-menu a.active').removeClass('active');
        $(this).addClass('active');
    });
</script>